tap 'caskroom/cask'
brew 'brew-cask'
tap 'homebrew/versions'
#tap phinze/homebrew-cask
#tap gaishimo/homebrew-cask

brew 'zsh'
brew 'git'
brew 'coreutils'
#brew 'samba'

# ruby
#brew 'rbenv'
#brew 'ruby-build'
#brew 'rbenv-gemset'
#brew 'rbenv-gem-rehash'
brew 'python'
#brew 'mysql'

brew 'gawk'
brew 'gnu-sed'
brew 'nmap'
brew 'wget'
brew 'tree'
brew 'jq'
brew 'pwgen'

brew 'imagemagick'
brew 'graphviz'

brew 'tmux'
brew 'openssl'
brew 'readline'
brew 'nkf'
tap 'sanemat/font'
brew 'ricty'
brew 'cmake'
brew 'libtool'
brew 'automake'
brew 'hub'
#brew 'redis'
brew 'watch'
brew 'ag'
brew 'ipcalc'
brew 'ctags'

#brew 'docker'
#brew 'boot2docker'

#brew 'mecab'
#brew 'mecab-ipadic'

brew 'reattach-to-user-namespace'

brew 'ffmpeg'

# casks

cask 'java'
cask 'firefox'
cask 'opera'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'sequel-pro'
cask 'atom'
#cask 'skitch'
cask 'skype'
cask 'charles'
#cask 'dash'
#cask 'kobito'
cask 'virtualbox'
#cask 'vagrant'
#cask 'yorufukurou'
#cask 'sophos-anti-virus-home-edition'
cask 'dropbox'
cask 'hipchat'
cask 'heroku-toolbelt'
#cask 'alfred'
#cask 'divvy'
cask 'macvim'
#cask 'sublime-text3'
cask 'iterm2'
cask 'node-webkit'
cask 'jumpcut'
cask 'xquartz'
cask 'wireshark'
cask 'libreoffice'
